/**
 * 任务定义
 */

var TASK_DEFINITIONS = {
  character_0: {
    chapter_1: [
      {
        id: 'c0_ch1_t1',
        title: '任务一',
        desc: '弄清楚发生了什么。'
      },
      {
        id: 'c0_ch1_t2',
        title: '任务二',
        desc: '找到心脏。'
      }
    ],
    chapter_2: [
      {
        id: 'c0_ch2_t1',
        title: '任务一',
        desc: '尽全力准备迎接考核，争取当上班长吧！'
      }
    ],
    chapter_3: [
      {
        id: 'c0_ch3_t1',
        title: '任务一',
        desc: '记住在老师面前隐藏身份，别被发现你不属于这里。'
      },
      {
        id: 'c0_ch3_t2',
        title: '任务二',
        desc: '和朋友们多年不见，问问这些年都发生了什么。'
      }
    ]
  },
  character_1: {
    chapter_1: [
      {
        id: 'c1_ch1_t1',
        title: '任务一',
        desc: '弄清楚发生了什么。'
      },
      {
        id: 'c1_ch1_t2',
        title: '任务二',
        desc: '不要被任何人发现心脏在你这里。'
      }
    ],
    chapter_2: [
      {
        id: 'c1_ch2_t1',
        title: '任务一',
        desc: '你们的计划要对任鸣严格保密，千万要保密，不然就竹篮打水一场空了。'
      },
      {
        id: 'c1_ch2_t2',
        title: '任务二',
        desc: '在老师把任鸣喊出去罚站之后，要立刻开始创作你们的贺卡（请记住，你们五人用同一张白纸就可以，不要分开画，纸可是稀缺资源，不能被老师发现。）'
      },
      {
        id: 'c1_ch2_t3',
        title: '任务三',
        desc: '当然，考核也是很重要的，这决定了你的未来，要好好考试。'
      },
      {
        id: 'c1_ch2_t4',
        title: '任务四',
        desc: '加油啊，小唐。'
      }
    ],
    chapter_3: [
      {
        id: 'c1_ch3_t1',
        title: '任务一',
        desc: '在混乱中保持冷静，保护好身边的朋友。'
      },
      {
        id: 'c1_ch3_t2',
        title: '任务二',
        desc: '和年幼时的朋友们重新建立联系，但要小心不要暴露彼此的身份。'
      },
      {
        id: 'c1_ch3_t3',
        title: '任务三',
        desc: '记住你的编号：H0706。'
      }
    ]
  },
  character_2: {
    chapter_1: [
      {
        id: 'c2_ch1_t1',
        title: '任务一',
        desc: '弄清楚发生了什么。'
      },
      {
        id: 'c2_ch1_t2',
        title: '任务二',
        desc: '找到心脏。'
      }
    ],
    chapter_2: [
      {
        id: 'c2_ch2_t1',
        title: '任务一',
        desc: '你们的计划要对任鸣严格保密，千万要保密，不然就竹篮打水一场空了。'
      },
      {
        id: 'c2_ch2_t2',
        title: '任务二',
        desc: '在老师把任鸣喊出去罚站之后，要立刻开始创作你们的贺卡（请记住，你们五人用同一张白纸就可以，不要分开画，纸可是稀缺资源，不能被老师发现。）'
      },
      {
        id: 'c2_ch2_t3',
        title: '任务三',
        desc: '当然，考核也是很重要的，这决定了你的未来，要好好考试。'
      },
      {
        id: 'c2_ch2_t4',
        title: '任务四',
        desc: '虽然你很可怜地承担了很重要的任务，但还是要加油啊，小沈。'
      }
    ],
    chapter_3: [
      {
        id: 'c2_ch3_t1',
        title: '任务一',
        desc: '不要在老师面前透露各位好友的身份，不要告诉众人母亲曾教你诗歌的事。记住你的编号P1002。'
      },
      {
        id: 'c2_ch3_t2',
        title: '任务二',
        desc: '探究周遭环境，找到出去的方式。'
      },
      {
        id: 'c2_ch3_t3',
        title: '任务三',
        desc: '尽量在老师面前掩护这些朋友。'
      }
    ]
  },
  character_3: {
    chapter_1: [
      {
        id: 'hd_ch1_t1',
        title: '任务一',
        desc: '弄清楚发生了什么。'
      },
      {
        id: 'hd_ch1_t2',
        title: '任务二',
        desc: '找到心脏。'
      }
    ],
    chapter_2: [
      {
        id: 'hd_ch2_t1',
        title: '任务一',
        desc: '你们的计划要对任鸣严格保密，千万要保密，不然就竹篮打水一场空了。'
      },
      {
        id: 'hd_ch2_t2',
        title: '任务二',
        desc: '在老师把任鸣喊出去罚站之后，要立刻开始创作你们的贺卡（请记住，你们五人用同一张白纸就可以了，不要分开画，纸可是稀缺资源，不能被老师发现。）'
      },
      {
        id: 'hd_ch2_t3',
        title: '任务三',
        desc: '当然，考核也是很重要的，这决定了你的未来，要好好考试。'
      },
      {
        id: 'hd_ch2_t4',
        title: '任务四',
        desc: '加油啊，小贺！'
      }
    ],
    chapter_3: [
      {
        id: 'hd_ch3_t1',
        title: '任务一',
        desc: '和久别重逢的朋友们讲讲你经历的事，但不要在老师面前透露你的真实情况。'
      },
      {
        id: 'hd_ch3_t2',
        title: '任务二',
        desc: '千万别被老师发现你不属于这里。'
      },
      {
        id: 'hd_ch3_t3',
        title: '任务三',
        desc: '与任鸣互相掩护。'
      }
    ]
  },
  character_4: {
    chapter_1: [
      {
        id: 'c4_ch1_t1',
        title: '任务一',
        desc: '弄清楚发生了什么。'
      },
      {
        id: 'c4_ch1_t2',
        title: '任务二',
        desc: '找到心脏。'
      }
    ],
    chapter_2: [
      {
        id: 'c4_ch2_t1',
        title: '任务一',
        desc: '你们的计划要对任鸣严格保密，千万要保密，不然就竹篮打水一场空了。'
      },
      {
        id: 'c4_ch2_t2',
        title: '任务二',
        desc: '在老师把任鸣喊出去罚站之后，要立刻开始创作你们的贺卡（请记住，你们五人用同一张白纸就可以，不要分开画，纸可是稀缺资源，不能被老师发现。）'
      },
      {
        id: 'c4_ch2_t3',
        title: '任务三',
        desc: '当然，考核也是很重要的，这决定了你的未来，要好好考试。'
      },
      {
        id: 'c4_ch2_t4',
        title: '任务四',
        desc: '加油啊，小李。'
      }
    ],
    chapter_3: [
      {
        id: 'c4_ch3_t1',
        title: '任务一',
        desc: '在混乱中保持冷静，保护好身边的朋友。'
      },
      {
        id: 'c4_ch3_t2',
        title: '任务二',
        desc: '和年幼时的朋友们重新建立联系，但要小心不要暴露彼此的身份。'
      },
      {
        id: 'c4_ch3_t3',
        title: '任务三',
        desc: '记住你的编号：A0517。'
      }
    ]
  },
  character_5: {
    chapter_1: [
      {
        id: 'c5_ch1_t1',
        title: '任务一',
        desc: '弄清楚发生了什么。'
      },
      {
        id: 'c5_ch1_t2',
        title: '任务二',
        desc: '找到心脏。'
      }
    ],
    chapter_2: [
      {
        id: 'c5_ch2_t1',
        title: '任务一',
        desc: '你们的计划要对任鸣严格保密，千万要保密，不然就竹篮打水一场空了。'
      },
      {
        id: 'c5_ch2_t2',
        title: '任务二',
        desc: '在老师把任鸣喊出去罚站之后，要立刻开始创作你们的贺卡（请记住，你们五人用同一张白纸就可以，不要分开画，纸可是稀缺资源，不能被老师发现。）'
      },
      {
        id: 'c5_ch2_t3',
        title: '任务三',
        desc: '当然，考核也是很重要的，这决定了你的未来，要好好考试。'
      },
      {
        id: 'c5_ch2_t4',
        title: '任务四',
        desc: '加油啊，小江。'
      }
    ],
    chapter_3: [
      {
        id: 'c5_ch3_t1',
        title: '任务一',
        desc: '在老师到来之前，记得将你、任鸣、贺冬青的身份信息填进表格中。'
      },
      {
        id: 'c5_ch3_t2',
        title: '任务二',
        desc: '不要在老师面前透露自己的身份信息，此时你已经不是桃源居民，暴露了恐怕会有别的麻烦。记住你的代号：游子，T0221。如果老师不在，曾经的朋友们问起，可以给他们讲讲你这些年的经历。'
      },
      {
        id: 'c5_ch3_t3',
        title: '任务三',
        desc: '尽量在老师面前照顾并掩护贺冬青和任鸣。'
      }
    ]
  }
};
